###############################################################################
# Copyright (c) 2005, 2014 IBM Corporation and others.
# This program and the accompanying materials are made
# available under the terms of the Eclipse Public License 2.0
# which is available at https://www.eclipse.org/legal/epl-2.0/
#
# SPDX-License-Identifier: EPL-2.0
#
# Contributors:
#     IBM Corporation - initial API and implementation
###############################################################################

# This file should be translated.

# "featureName" property - name of the feature
featureName=Graphical Modeling Framework (GMF)\u306E\u8868\u8A18\u6CD5

# "providerName" property - name of the company that provides the feature
providerName=Eclipse Modeling Project

# "updateSiteName" property - label for the update site
updateSiteName=Graphical Modeling Framework (GMF)\u306E\u66F4\u65B0

# "description" property - description of the feature
description=Graphical Modeling Framework\u306E\u8868\u8A18\u6CD5


# "licenseURL" property - URL of the "Feature License"
# do not translate value - just change to point to a locale-specific HTML page
licenseURL=license.html

# "license" property - text of the "Feature Update License"
# should be plain text version of license agreement pointed to be "licenseURL"
license=Eclipse Foundation\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u5229\u7528\u8A31\u8AFE\u5951\u7D04\n\n2017\u5E7411\u670822\u65E5\n\n\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u5229\u7528\n\nECLIPSE FOUNDATION\u306F\u3001\u30AA\u30FC\u30D7\u30F3\u30BD\u30FC\u30B9\u30D7\u30ED\u30B8\u30A7\u30AF\u30C8\u306E\u305F\u3081\u306E\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u3001\u30C9\u30AD\u30E5\u30E1\u30F3\u30C6\u30FC\u30B7\u30E7\u30F3\u3001\u60C5\u5831\u3001\n\u305D\u306E\u4ED6\u306E\u8CC7\u6599(\u4EE5\u4E0B\u3001\u7DCF\u79F0\u3057\u3066\u300C\u30B3\u30F3\u30C6\u30F3\u30C4\u300D\u3068\u3044\u3044\u307E\u3059)\u3092\u63D0\u4F9B\u3057\u3066\u3044\u307E\u3059\u3002\n\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u4F7F\u7528\u306B\u306F\u3001\u672C\u5951\u7D04\u306E\u6761\u4EF6\u3001\u304A\u3088\u3073\u4EE5\u4E0B\u306B\u660E\u793A\u307E\u305F\u306F\u53C2\u7167\u3055\u308C\u3066\u3044\u308B\n\u30E9\u30A4\u30BB\u30F3\u30B9\u5951\u7D04\u307E\u305F\u306F\u901A\u77E5\u306E\u6761\u4EF6\u304C\u9069\u7528\u3055\u308C\u307E\u3059\u3002\n\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u4F7F\u7528\u3059\u308B\u3053\u3068\u306B\u3088\u308A\u3001\u304A\u5BA2\u69D8\u306F\u3001\u305D\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u4F7F\u7528\u304C\u672C\u5951\u7D04\u304A\u3088\u3073/\u307E\u305F\u306F\u4EE5\u4E0B\u306B\u793A\u3055\u308C\u305F\u3001\n\u307E\u305F\u306F\u53C2\u7167\u3055\u308C\u305F\u8A72\u5F53\u30E9\u30A4\u30BB\u30F3\u30B9\u5951\u7D04\u3082\u3057\u304F\u306F\u901A\u77E5\u306E\u6761\u4EF6\u306B\n\u6E96\u62E0\u3059\u308B\u3053\u3068\u306B\u540C\u610F\u3059\u308B\u3082\u306E\u3068\u3057\u307E\u3059\u3002\u672C\u5951\u7D04\u306E\u6761\u4EF6\n\u304A\u3088\u3073\u4EE5\u4E0B\u306B\u793A\u3055\u308C\u305F\u3001\u307E\u305F\u306F\u53C2\u7167\u3055\u308C\u305F\u9069\u7528\u53EF\u80FD\u306A\u30E9\u30A4\u30BB\u30F3\u30B9\u5951\u7D04\n\u307E\u305F\u306F\u901A\u77E5\u306E\u6761\u4EF6\u306B\u540C\u610F\u3055\u308C\u306A\u3044\u5834\u5408\u306F\u3001\n\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u4F7F\u7528\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002\n\n\u9069\u7528\u3055\u308C\u308B\u30E9\u30A4\u30BB\u30F3\u30B9\n\n\u5225\u6BB5\u306E\u898F\u5B9A\u304C\u306A\u3044\u9650\u308A\u3001Eclipse Foundation\u304C\u63D0\u4F9B\u3059\u308B\u3059\u3079\u3066\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u306F\u3001\nEclipse Public License Version 2.0 (\u4EE5\u4E0B\u300CEPL\u300D)\n\u306E\u6761\u4EF6\u306B\u57FA\u3065\u3044\u3066\u63D0\u4F9B\u3055\u308C\u307E\u3059\u3002EPL \u306E\u30B3\u30D4\u30FC\u306F\u672C\u30B3\u30F3\u30C6\u30F3\u30C4\u306B\u6DFB\u4ED8\u3055\u308C\u3066\u304A\u308A\u3001\nhttp://www.eclipse.org/legal/epl-2.0 \u3067\u3082\u5165\u624B\u3067\u304D\u307E\u3059\u3002EPL\u306E\u76EE\u7684\u4E0A\u3001\n\u300C\u30D7\u30ED\u30B0\u30E9\u30E0\u300D\u3068\u306F\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u610F\u5473\u3057\u307E\u3059\u3002\n\n\u30B3\u30F3\u30C6\u30F3\u30C4\u306B\u306F\u3001Eclipse Foundation\u306E\u30BD\u30FC\u30B9\u30B3\u30FC\u30C9\u30EA\u30DD\u30B8\u30C8\u30EA\u30FC(\u4EE5\u4E0B\u300C\u30EA\u30DD\u30B8\u30C8\u30EA\u30FC\u300D)\u3067\n\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u30E2\u30B8\u30E5\u30FC\u30EB(\u4EE5\u4E0B\u300C\u30E2\u30B8\u30E5\u30FC\u30EB\u300D)\u3068\u3057\u3066\u7BA1\u7406\u3055\u308C\u3001\n\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u53EF\u80FD\u306A\u30A2\u30FC\u30AB\u30A4\u30D6(\u4EE5\u4E0B\u300C\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u300D)\u3068\u3057\u3066\u63D0\u4F9B\u3055\u308C\u3066\u3044\u308B\n\u30BD\u30FC\u30B9\u30B3\u30FC\u30C9\u3001\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30B3\u30FC\u30C9\u3001\u30C9\u30AD\u30E5\u30E1\u30F3\u30C6\u30FC\u30B7\u30E7\u30F3\u3001\u305D\u306E\u4ED6\u306E\u30D5\u30A1\u30A4\u30EB\u304C\u542B\u307E\u308C\u307E\u3059\u304C\u3001\u3053\u308C\u3089\u306B\u9650\u5B9A\u3055\u308C\u308B\u3082\u306E\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002\n\n-   \u30B3\u30F3\u30C6\u30F3\u30C4\u306F\u3001\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u914D\u4FE1\u3001\u62E1\u5F35\u3001\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u304C\u5BB9\u6613\u306B\u306A\u308B\u3088\u3046\n\u30E2\u30B8\u30E5\u30FC\u30EB\u3078\u3068\u69CB\u9020\u5316\u304A\u3088\u3073\u30D1\u30C3\u30B1\u30FC\u30B8\u5316\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002\u5178\u578B\u7684\u306A\u30E2\u30B8\u30E5\u30FC\u30EB\u3068\u3057\u3066\u3001\n\u30D7\u30E9\u30B0\u30A4\u30F3(\u4EE5\u4E0B\u300C\u30D7\u30E9\u30B0\u30A4\u30F3\u300D)\u3001\u30D7\u30E9\u30B0\u30A4\u30F3\u30D5\u30E9\u30B0\u30E1\u30F3\u30C8(\u4EE5\u4E0B\u300C\u30D5\u30E9\u30B0\u30E1\u30F3\u30C8\u300D)\u3001\n\u6A5F\u80FD(\u4EE5\u4E0B\u300C\u6A5F\u80FD\u300D)\u304C\u3042\u308A\u307E\u3059\u3002\n-   \u30D7\u30E9\u30B0\u30A4\u30F3\u3084\u30D5\u30E9\u30B0\u30E1\u30F3\u30C8\u306F\u305D\u308C\u305E\u308C\u3001"plugins"\u3068\u3044\u3046\u540D\u524D\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u306E\u30B5\u30D6\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\n\u307E\u305F\u306FJAR (Java\u2122 ARchive)\u3068\u3057\u3066\u30D1\u30C3\u30B1\u30FC\u30B8\u5316\u3055\u308C\u307E\u3059\u3002\n-   \u6A5F\u80FD\u3068\u306F\u30011\u3064\u307E\u305F\u306F\u8907\u6570\u306E\u30D7\u30E9\u30B0\u30A4\u30F3\u3084\u30D5\u30E9\u30B0\u30E1\u30F3\u30C8\u3068\u305D\u308C\u306B\u95A2\u9023\u3059\u308B\u30DE\u30C6\u30EA\u30A2\u30EB\u3092\n\u30D0\u30F3\u30C9\u30EB\u3057\u305F\u3082\u306E\u3067\u3059\u3002\u6A5F\u80FD\u306F\u305D\u308C\u305E\u308C"features"\u3068\u3044\u3046\u540D\u524D\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u5185\u306E\u30B5\u30D6\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3068\u3057\u3066\n\u30D1\u30C3\u30B1\u30FC\u30B8\u5316\u3055\u308C\u307E\u3059\u3002\u6A5F\u80FD\u306E\u5185\u90E8\u306B\u306F"feature.xml"\u3068\u3044\u3046\u540D\u524D\u306E\u30D5\u30A1\u30A4\u30EB\u304C\u3042\u308A\u3001\n\u305D\u306E\u6A5F\u80FD\u306B\u95A2\u9023\u3059\u308B\u30D7\u30E9\u30B0\u30A4\u30F3\u3084\u30D5\u30E9\u30B0\u30E1\u30F3\u30C8\u306E\u540D\u524D\u3068\u30D0\u30FC\u30B8\u30E7\u30F3\u756A\u53F7\u306E\u30EA\u30B9\u30C8\u304C\n\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002\n-   \u6A5F\u80FD\u306B\u306F\u3001\u4ED6\u306E\u6A5F\u80FD(\u4EE5\u4E0B\u300CIncluded Features\u300D)\u304C\u542B\u307E\u308C\u308B\u3053\u3068\u3082\u3042\u308A\u307E\u3059\u3002\n\u6A5F\u80FD\u5185\u306B\u3042\u308B"feature.xml "\u3068\u3044\u3046\u540D\u524D\u306E\u30D5\u30A1\u30A4\u30EB\u306B\u306F\u3001\nIncluded Features\u306E\u540D\u524D\u3068\u30D0\u30FC\u30B8\u30E7\u30F3\u756A\u53F7\u306E\u30EA\u30B9\u30C8\u304C\u542B\u307E\u308C\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002\n\n\u30D7\u30E9\u30B0\u30A4\u30F3\u304A\u3088\u3073\u30D5\u30E9\u30B0\u30E1\u30F3\u30C8\u306B\u9069\u7528\u3055\u308C\u308B\u6761\u4EF6\u306F\u3001\n"about.html" (\u4EE5\u4E0B\u300CAbouts\u300D)\u3068\u3044\u3046\u30D5\u30A1\u30A4\u30EB\u306B\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002\u6A5F\u80FD\u304A\u3088\u3073Included Features\u306B\u9069\u7528\u3055\u308C\u308B\u6761\u4EF6\u306F\u3001\n"license.html" (\u4EE5\u4E0B\u300CFeature Licenses\u300D)\n\u3068\u3044\u3046\u30D5\u30A1\u30A4\u30EB\u306B\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002Abouts\u304A\u3088\u3073Feature Licenses\u306F\u3001\n\u4EE5\u4E0B\u306E\u5834\u6240\u3092\u306F\u3058\u3081\u3068\u3057\u3066\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u3084\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u4EFB\u610F\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u306B\u914D\u7F6E\u3067\u304D\u307E\u3059\u304C\u3001\n\u3053\u308C\u3089\u306B\u9650\u5B9A\u3055\u308C\u308B\u3082\u306E\u3067\u306F\u3042\u308A\u307E\u305B\u3093:\n\n-   \u30C8\u30C3\u30D7\u30EC\u30D9\u30EB(\u30EB\u30FC\u30C8)\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\n-   \u30D7\u30E9\u30B0\u30A4\u30F3\u304A\u3088\u3073\u30D5\u30E9\u30B0\u30E1\u30F3\u30C8\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\n-   JAR\u3068\u3057\u3066\u30D1\u30C3\u30B1\u30FC\u30B8\u5316\u3055\u308C\u305F\u30D7\u30E9\u30B0\u30A4\u30F3\u3068\u30D5\u30E9\u30B0\u30E1\u30F3\u30C8\u306E\u5185\u90E8\n-   \u7279\u5B9A\u306E\u30D7\u30E9\u30B0\u30A4\u30F3\u306E "src"\u3068\u3044\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u306E\u30B5\u30D6\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\n-   \u6A5F\u80FD\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\n\n\u6CE8: Eclipse Foundation\u304C\u63D0\u4F9B\u3059\u308B\u6A5F\u80FD\u3092\n\u30D7\u30ED\u30D3\u30B8\u30E7\u30CB\u30F3\u30B0\u6280\u8853(\u4EE5\u4E0B\u306B\u5B9A\u7FA9)\u3092\u4F7F\u3063\u3066\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3059\u308B\u5834\u5408\u3001\n\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u306E\u904E\u7A0B\u3067\u30E9\u30A4\u30BB\u30F3\u30B9(\u4EE5\u4E0B\u300CFeature Update License\u300D)\u306B\u540C\u610F\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\n\u305D\u306E\u6A5F\u80FD\u306BIncluded Features\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u5834\u5408\u3001Feature Update License\u306B\u3001\nIncluded Features\u3078\u306E\u9069\u7528\u6761\u4EF6\u304C\u8A18\u8F09\u3055\u308C\u3066\u3044\u308B\u304B\u3001\n\u305D\u306EIncluded Features\u3092\u7279\u5B9A\u3067\u304D\u308B\u5834\u6240\u304C\u901A\u77E5\u3055\u308C\u3066\u3044\u307E\u3059\u3002Feature Update License\u306F\u3001\n\u305D\u306E\u6A5F\u80FD\u5185\u306B\u3042\u308B"feature.properties"\u3068\u3044\u3046\u30D5\u30A1\u30A4\u30EB\u306E"license"\u30D7\u30ED\u30D1\u30C6\u30A3\u306B\u8A18\u8F09\u3055\u308C\u3066\u3044\u307E\u3059\u3002\n\u3053\u306E\u3088\u3046\u306AAbouts\u3001Feature Licenses\u3001Feature Update Licenses\u306B\u306F\u3001\n\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u5185\u306E\u95A2\u9023\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u304A\u5BA2\u69D8\u306B\u3088\u308B\u4F7F\u7528\u306B\u95A2\u3059\u308B\u898F\u5B9A\u6761\u4EF6\n(\u307E\u305F\u306F\u305D\u306E\u3088\u3046\u306A\u6761\u4EF6\u3078\u306E\u53C2\u7167)\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002\n\nAbouts\u3001Feature Licenses\u3001Feature Update Licenses\u306F\u3001EPL\n\u307E\u305F\u306F\u305D\u306E\u4ED6\u306E\u30E9\u30A4\u30BB\u30F3\u30B9\u5951\u7D04\u3001\u901A\u77E5\u3001\u307E\u305F\u306F\u6761\u4EF6\u3092\u53C2\u7167\u3067\u304D\u307E\u3059\u3002\u3053\u308C\u3089\u306E\u4ED6\u306E\n\u30E9\u30A4\u30BB\u30F3\u30B9\u5951\u7D04\u306B\u306F\u4EE5\u4E0B\u306E\u3082\u306E\u304C\u542B\u307E\u308C\u307E\u3059\u304C\u3001\u3053\u308C\u3089\u306B\u9650\u5B9A\u3055\u308C\u308B\u3082\u306E\u3067\u306F\u3042\u308A\u307E\u305B\u3093:\n\n-   Eclipse Public License Version 1.0\n(http://www.eclipse.org/legal/epl-v10.html\u3088\u308A\u5165\u624B\u53EF\u80FD)\n-   Eclipse Distribution License Version 1.0\n(http://www.eclipse.org/licenses/edl-v1.0\u3088\u308A\u5165\u624B\u53EF\u80FD)\n-   Common Public License Version 1.0\n(http://www.eclipse.org/legal/cpl-v10.html\u3088\u308A\u5165\u624B\u53EF\u80FD)\n-   Apache Software License 1.1\n(http://www.apache.org/licenses/LICENSE\u3088\u308A\u5165\u624B\u53EF\u80FD)\n-   Apache Software License 2.0\n(http://www.apache.org/licenses/LICENSE-2.0\u3088\u308A\u5165\u624B\u53EF\u80FD)\n-   Mozilla Public License Version 1.1\n(http://www.mozilla.org/MPL/MPL-1.1.html\u3088\u308A\u5165\u624B\u53EF\u80FD)\n\n\u3053\u308C\u3089\u306E\u6761\u4EF6\u3092\u3059\u3079\u3066\u8AAD\u307F\u3001\n\u540C\u610F\u3059\u308B\u3053\u3068\u306F\u304A\u5BA2\u69D8\u306E\u7FA9\u52D9\u3067\u3059\u3002About\u3001 Feature License\u3001Feature Update License\u304C\u63D0\u4F9B\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001\n\u305D\u306E\u7279\u5B9A\u30B3\u30F3\u30C6\u30F3\u30C4\u306B\u3069\u306E\u3088\u3046\u306A\u6761\u4EF6\u304C\u9069\u7528\u3055\u308C\u308B\u304B\u306B\u3064\u3044\u3066Eclipse Foundation\u3078\n\u304A\u554F\u3044\u5408\u308F\u305B\u304F\u3060\u3055\u3044\u3002\n\n\u30D7\u30ED\u30D3\u30B8\u30E7\u30CB\u30F3\u30B0\u6280\u8853\u306E\u4F7F\u7528\n\nEclipse Foundation\u306F\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u3001\u30C9\u30AD\u30E5\u30E1\u30F3\u30C6\u30FC\u30B7\u30E7\u30F3\u3001\u60C5\u5831\u3001\u305D\u306E\u4ED6\u306E\u8CC7\u6599\n(\u7DCF\u79F0\u3057\u3066\u300C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u53EF\u80FD\u306A\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u300D)\u3092\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u76EE\u7684\u3067\u3001\n\u30D7\u30ED\u30D3\u30B8\u30E7\u30CB\u30F3\u30B0\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2(\u4EE5\u4E0B\u300C\u30D7\u30ED\u30D3\u30B8\u30E7\u30CB\u30F3\u30B0\u6280\u8853\u300D\u3068\u3057\u3001\np2\u304A\u3088\u3073Eclipse Update Manager\u3092\u542B\u3080\u304C\u305D\u308C\u3089\u306B\u9650\u5B9A\u3055\u308C\u306A\u3044)\n\u3092\u63D0\u4F9B\u3057\u3066\u3044\u307E\u3059\u3002\u3053\u306E\u6A5F\u80FD\u306F\u3001\u30E6\u30FC\u30B6\u30FC\u304CEclipse\u30D9\u30FC\u30B9\u306E\u88FD\u54C1\u3092\n\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3001\u62E1\u5F35\u3001\u66F4\u65B0\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u3053\u3068\u3092\u76EE\u7684\u3068\u3057\u3066\u63D0\u4F9B\u3055\u308C\u3066\u3044\u307E\u3059\u3002\n\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u53EF\u80FD\u306A\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u306E\u30D1\u30C3\u30B1\u30FC\u30B8\u5316\u306B\u95A2\u3059\u308B\u60C5\u5831\u306F\u3001\nhttp://eclipse.org/equinox/p2/repository_packaging.html (\u4EE5\u4E0B\u300C\u4ED5\u69D8\u300D)\u3067\u3054\u89A7\u3044\u305F\u3060\u3051\u307E\u3059\u3002\n\n\u304A\u5BA2\u69D8\u306F\u3001\u30D7\u30ED\u30D3\u30B8\u30E7\u30CB\u30F3\u30B0\u6280\u8853\u3092\u4F7F\u7528\u3057\u3066\u3001\u4ED6\u306E\u5F53\u4E8B\u8005\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u53EF\u80FD\u306A\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u3092\n\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002\u304A\u5BA2\u69D8\u306F\u3001\u4ED5\u69D8\u306B\u5F93\u3063\u3066\u3001\n\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u53EF\u80FD\u306A\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u306B\u95A2\u9023\u3059\u308B\u30E9\u30A4\u30BB\u30F3\u30B9\u5951\u7D04\u3092\u30D7\u30ED\u30D3\u30B8\u30E7\u30CB\u30F3\u30B0\u6280\u8853\u306E\u30E6\u30FC\u30B6\u30FC\u306B\u63D0\u793A\u3057\u3001\n\u53D7\u3051\u5165\u308C\u3089\u308C\u308B\u3088\u3046\u306B\u3059\u308B\u8CAC\u4EFB\u3092\u8CA0\u3044\u307E\u3059\u3002\n\u3053\u306E\u3088\u3046\u306A\u65B9\u6CD5\u3067\u30D7\u30ED\u30D3\u30B8\u30E7\u30CB\u30F3\u30B0\u6280\u8853\u3092\u4F7F\u7528\u3057\u3001\n\u672C\u4ED5\u69D8\u306B\u5F93\u3063\u3066\u30D7\u30ED\u30D3\u30B8\u30E7\u30CB\u30F3\u30B0\u6280\u8853\u3092\u5229\u7528\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u3053\u3068\u3067\u3001\n\u304A\u5BA2\u69D8\u306F\u4EE5\u4E0B\u306E\u4E8B\u9805\u306B\u540C\u610F\u3057\u3001\n\u3053\u308C\u3092\u8A31\u53EF\u3059\u308B\u305F\u3081\u306B\u5FC5\u8981\u306A\u3059\u3079\u3066\u306E\u6A29\u5229\u3092\u53D6\u5F97\u3057\u305F\u3053\u3068\u3092\u8A8D\u3081\u307E\u3059\u3002\n\n1.  \u4E00\u9023\u306E\u30A2\u30AF\u30B7\u30E7\u30F3(\u4EE5\u4E0B\u300C\u30D7\u30ED\u30D3\u30B8\u30E7\u30CB\u30F3\u30B0 \u30D7\u30ED\u30BB\u30B9\u300D)\u306E\u4E2D\u3067\u3001\n\u30E6\u30FC\u30B6\u30FC\u306FEclipse\u30D9\u30FC\u30B9\u306E\u88FD\u54C1\u306E\u6A5F\u80FD\u3092\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3001\u62E1\u5F35\u3001\u66F4\u65B0\u3059\u308B\u76EE\u7684\u3067\u3001\n\u30DE\u30B7\u30F3(\u4EE5\u4E0B\u300C\u30BF\u30FC\u30B2\u30C3\u30C8 \u30DE\u30B7\u30F3\u300D)\u4E0A\u3067\u30D7\u30ED\u30D3\u30B8\u30E7\u30CB\u30F3\u30B0\u6280\u8853\u3092\n\u5B9F\u884C\u3067\u304D\u307E\u3059\u3002\n2.  \u30D7\u30ED\u30D3\u30B8\u30E7\u30CB\u30F3\u30B0\u30D7\u30ED\u30BB\u30B9\u4E2D\u3001\u30D7\u30ED\u30D3\u30B8\u30E7\u30CB\u30F3\u30B0\u6280\u8853\u306F\u3001\n\u30B5\u30FC\u30C9\u30D1\u30FC\u30C6\u30A3\u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u53EF\u80FD\u306A\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u307E\u305F\u306F\u305D\u306E\u4E00\u90E8\u306B\u30A2\u30AF\u30BB\u30B9\u3057\u3001\n\u30BF\u30FC\u30B2\u30C3\u30C8\u30DE\u30B7\u30F3\u306B\u30B3\u30D4\u30FC\u3067\u304D\u307E\u3059\u3002\n3.  \u672C\u4ED5\u69D8\u306B\u5F93\u3063\u3066\u3001\u304A\u5BA2\u69D8\u306F\u3001\n\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u53EF\u80FD\u306A\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u306E\u4F7F\u7528\u3092\u898F\u5B9A\u3059\u308B\u6761\u4EF6\n(\u4EE5\u4E0B\u300C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u53EF\u80FD\u306A\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u5951\u7D04\u300D)\u3092\u30E6\u30FC\u30B6\u30FC\u306B\u63D0\u4F9B\u3057\u3001\n\u5F53\u8A72\u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u53EF\u80FD\u306A\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u5951\u7D04\u306F\u3001\u672C\u4ED5\u69D8\u66F8\u306B\u5F93\u3063\u3066\u30BF\u30FC\u30B2\u30C3\u30C8\u30DE\u30B7\u30F3\u304B\u3089\u30A2\u30AF\u30BB\u30B9\u3055\u308C\u308B\u3082\u306E\u3068\u3057\u307E\u3059\u3002\n\u5F53\u8A72\u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u53EF\u80FD\u306A\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u5951\u7D04\u306F\u3001\n\u305D\u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u53EF\u80FD\u306A\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u3092\u898F\u5B9A\u3059\u308B\u6761\u4EF6\u3092\u30E6\u30FC\u30B6\u30FC\u306B\u901A\u77E5\u3057\u3001\n\u5F53\u8A72\u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u53EF\u80FD\u306A\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u5951\u7D04\u306B\u5B9A\u3081\u308B\u65B9\u6CD5\u3067\u30A8\u30F3\u30C9\u30E6\u30FC\u30B6\u30FC\u306E\u540C\u610F\u3092\n\u6C42\u3081\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002\u30E6\u30FC\u30B6\u30FC\u304C\u540C\u610F\u3092\u793A\u3057\u305F\u5834\u5408\u3001\n\u30D7\u30ED\u30D3\u30B8\u30E7\u30CB\u30F3\u30B0\u6280\u8853\u306F\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u53EF\u80FD\u306A\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u306E\n\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3092\u5B8C\u4E86\u3057\u307E\u3059\u3002\n\n\u6697\u53F7\n\n\u30B3\u30F3\u30C6\u30F3\u30C4\u306B\u306F\u3001\u6697\u53F7\u5316\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002\u304A\u5BA2\u69D8\u304C\u73FE\u5728\u304A\u4F4F\u307E\u3044\u306E\u56FD\u3067\u306F\u3001\n\u6697\u53F7\u5316\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u306E\u8F38\u5165\u3001\u4FDD\u6709\u3001\u4F7F\u7528\u3001\u4ED6\u56FD\u3078\u306E\u518D\u8F38\u51FA\u304C\u5236\u9650\u3055\u308C\u3066\u3044\u308B\n\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002\u6697\u53F7\u5316\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u3092\u4F7F\u7528\u3059\u308B\u524D\u306B\u3001\n\u305D\u306E\u56FD\u306E\u6697\u53F7\u5316\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u306E\u8F38\u5165\u3001\n\u6240\u6709\u3001\u4F7F\u7528\u3001\u518D\u8F38\u51FA\u306B\u95A2\u3059\u308B\u6CD5\u5F8B\u3001\u898F\u5236\u3001\u30DD\u30EA\u30B7\u30FC\u3092\u78BA\u8A8D\u3057\u3001\u8A31\u53EF\u3055\u308C\u3066\u3044\u308B\u304B\u3069\u3046\u304B\n\u3054\u78BA\u8A8D\u304F\u3060\u3055\u3044\u3002\n\nJava\u304A\u3088\u3073\u3059\u3079\u3066\u306EJava\u30D9\u30FC\u30B9\u306E\u5546\u6A19\u306F\u3001\u7C73\u56FDOracle Corporation\u306E\u7C73\u56FD\u3001\n\u305D\u306E\u4ED6\u306E\u56FD\u3001\u307E\u305F\u306F\u305D\u306E\u4E21\u65B9\u306B\u304A\u3051\u308B\u5546\u6A19\u3067\u3059\u3002\n
########### end of license property ##########################################
