###############################################################################
# Copyright (c) 2005, 2014 IBM Corporation and others.
# This program and the accompanying materials are made
# available under the terms of the Eclipse Public License 2.0
# which is available at https://www.eclipse.org/legal/epl-2.0/
#
# SPDX-License-Identifier: EPL-2.0
#
# Contributors:
#     IBM Corporation - initial API and implementation
###############################################################################

# This file should be translated.

# "featureName" property - name of the feature
featureName=Notation Graphical Modeling Framework (GMF)

# "providerName" property - name of the company that provides the feature
providerName=Eclipse Modeling Project

# "updateSiteName" property - label for the update site
updateSiteName=Mises \u00E0 jour de Graphical Modeling Framework (GMF)

# "description" property - description of the feature
description=Notation Graphical Modeling Framework


# "licenseURL" property - URL of the "Feature License"
# do not translate value - just change to point to a locale-specific HTML page
licenseURL=license.html

# "license" property - text of the "Feature Update License"
# should be plain text version of license agreement pointed to be "licenseURL"
license=Accord de licence relatif aux logiciels de la Fondation Eclipse\n\n22 novembre 2017\n\nUtilisation du contenu\n\nLA FONDATION ECLIPSE MET \u00C0 DISPOSITION DES LOGICIELS, DE LA DOCUMENTATION, DES INFORMATIONS\nET/OU D'AUTRES MAT\u00C9RIAUX POUR LES PROJETS OPEN SOURCE (COLLECTIVEMENT NOMM\u00C9S "CONTENU"). L'UTILISATION DE\nCE CONTENU EST SOUMISE AUX TERMES ET CONDITIONS DE CET ACCORD ET/OU AUX\nTERMES ET CONDITIONS DES ACCORDS DE LICENCE ET MENTIONS L\u00C9GALES INDIQU\u00C9S OU R\u00C9F\u00C9RENC\u00C9S\nCI-DESSOUS. EN UTILISANT LE CONTENU, VOUS ACCEPTEZ QUE VOTRE UTILISATION DU CONTENU SOIT SOUMISE\n\u00C0 CET ACCORD ET/OU AUX TERMES ET CONDITIONS DE TOUT ACCORD OU TOUTE MENTION L\u00C9GALE\nDE LICENCE APPLICABLE INDIQU\u00C9 OU R\u00C9F\u00C9RENC\u00C9 CI-DESSOUS. SI VOUS N'ACCEPTEZ PAS LES\nTERMES ET CONDITIONS DE CET ACCORD ET LES TERMES ET CONDITIONS DE TOUT ACCORD OU TOUTE MENTION L\u00C9GALE\nDE LICENCE APPLICABLE INDIQU\u00C9 OU R\u00C9F\u00C9RENC\u00C9 CI-DESSOUS, VOUS\nNE DEVEZ PAS UTILISER LE CONTENU.\n\nLicences applicables\n\nSauf en cas de mention contraire, tout le Contenu mis \u00E0 disposition par la Fondation Eclipse\nest fourni sous les termes et conditions de la licence Eclipse Public License\nversion 2.0 ("EPL"). Une copie de l'EPL est fournie avec ce Contenu et est \u00E9galement\ndisponible sur http://www.eclipse.org/legal/epl-2.0. Dans cette EPL,\n"Program" signifie le Contenu.\n\nLe Contenu comprend, mais n'est pas limit\u00E9 \u00E0 ces \u00E9lements : le code source, le code des objets, la documentation\net les autres fichiers maintenus dans le d\u00E9p\u00F4t du code source de la Fondation Eclipse\n("Repository"), dans les modules logiciels ("Modules") et mis \u00E0 disposition comme\narchives t\u00E9l\u00E9chargeables ("Downloads").\n\n-   Le Contenu peut \u00EAtre structur\u00E9 et packag\u00E9 en modules afin de simplifier\nla livraison, l'extension et la mise \u00E0 niveau du Contenu. Les modules typiques peuvent\ncomprendre les plug-ins ("Plug-ins"), les fragments de plug-ins ("Fragments") et les\nfonctionnalit\u00E9s ("Fonctionnalit\u00E9s").\n-   Chaque Plug-in ou Fragment peut \u00EAtre packag\u00E9 en tant que sous-r\u00E9pertoire ou JAR\n(Java\u2122 ARchive) dans un r\u00E9pertoire nomm\u00E9 "plugins".\n-   Une Fonctionnalit\u00E9 est un bundle d'un ou plusieurs Plug-in(s) et/ou Fragment(s) et du\nmat\u00E9riel associ\u00E9. Chaque fonctionnalit\u00E9 peut \u00EAtre packag\u00E9e en tant que sous-r\u00E9pertoire dans un\nr\u00E9pertoire nomm\u00E9 "features". Au sein d'une fonctionnalit\u00E9, les fichiers nomm\u00E9s "feature.xml" peuvent\ncontenir une liste des noms et num\u00E9ros de version des Plug-ins et/ou\nFragments associ\u00E9s \u00E0 cette Fonctionnalit\u00E9.\n-   Les Fonctionnalit\u00E9s peuvent \u00E9galement inclure d'autres Fonctionnalit\u00E9s ("Included Features"). Au sein d'une\nFonctionnalit\u00E9, les fichiers nomm\u00E9s "feature.xml" peuvent contenir une liste de noms et\nnum\u00E9ros de version des Included Features.\n\nLes termes et conditions r\u00E9gissant les Plug-ins et Fragments doivent \u00EAtre contenus dans\ndes fichiers nomm\u00E9s "about.html" ("Abouts"). Les termes et conditions r\u00E9gissant les Fonctionnalit\u00E9s\net les Included Features doivent \u00EAtre contenus dans des fichiers nomm\u00E9s "license.html"\n("Feature Licenses"). Les \u00E9l\u00E9ments Abouts et Feature Licenses peuvent \u00EAtre situ\u00E9s dans tout\nr\u00E9pertoire de Download ou Module, y compris, mais pas uniquement, les emplacements\nsuivants :\n\n-   R\u00E9pertoire du plus haut niveau (racine)\n-   R\u00E9pertoires des Plug-ins et Fragments\n-   Int\u00E9rieur des Plug-ins et Fragments packag\u00E9s en tant que JAR\n-   Sous-r\u00E9pertoires du r\u00E9pertoire nomm\u00E9 "src" de certains Plug-ins\n-   R\u00E9pertoires des Fonctionnalit\u00E9s\n\nNote : Si une Fonctionnalit\u00E9 mise \u00E0 disposition par la Fondation Eclipse est install\u00E9e \u00E0 l\u2019aide de\nla technologie de Provisioning (d\u00E9finie ci-dessous), vous devez accepter une licence\n("Feature Update License") au cours du processus d\u2019installation. Si la Fonctionnalit\u00E9\ncontient des Included Features, la licence Feature Update License doit vous fournir\nles termes et conditions r\u00E9gissant les Included Features ou vous informer\nde l\u2019emplacement o\u00F9 les trouver. La licence Feature Update License se trouve dans la propri\u00E9t\u00E9 "license"\ndes fichiers nomm\u00E9s "feature.properties", dans une Fonctionnalit\u00E9. Les \u00E9l\u00E9ments\nAbouts, Feature Licenses et Feature Update License contiennent les termes et\nconditions (ou des r\u00E9f\u00E9rences \u00E0 ces termes et conditions) r\u00E9gissant votre utilisation du\nContenu associ\u00E9 dans le r\u00E9pertoire.\n\nLES \u00C9L\u00C9MENTS ABOUTS, FEATURE LICENSES ET FEATURE UPDATE LICENSE PEUVENT FAIRE R\u00C9F\u00C9RENCE \u00C0 LA LICENCE EPL\nOU \u00C0 D\u2019AUTRES ACCORDS DE LICENCE, MENTIONS L\u00C9GALES OU TERMES ET CONDITIONS. CERTAINS DE CES\nACCORDS DE LICENCE PEUVENT INCLURE (MAIS NE SONT PAS LIMIT\u00C9S \u00C0) :\n\n-   Eclipse Public License version 1.0 (disponible sur\nhttp://www.eclipse.org/legal/epl-v10.html)\n-   Eclipse Distribution License version 1.0 (disponible sur\nhttp://www.eclipse.org/licenses/edl-v1.0.html)\n-   Common Public License version 1.0 (disponible sur\nhttp://www.eclipse.org/legal/cpl-v10.html)\n-   Licence Apache 1.1 (disponible sur\nhttp://www.apache.org/licenses/LICENSE)\n-   Licence Apache 2.0 (disponible sur\nhttp://www.apache.org/licenses/LICENSE-2.0)\n-   Mozilla Public License version 1.1 (disponible sur\nhttp://www.mozilla.org/MPL/MPL-1.1.html)\n\nVOUS AVEZ L'OBLIGATION DE LIRE ET D'ACCEPTER TOUS LES TERMES ET CONDITIONS\nD'UTILISATION DU CONTENU. Si aucun \u00E9l\u00E9ment About, Feature License ou Feature Update License n'est\nfourni, contactez la Fondation Eclipse pour d\u00E9terminer les termes et\nconditions r\u00E9gissant ce Contenu.\n\nUtilisation de la technologie de Provisioning\n\nLa Fondation Eclipse met \u00E0 disposition des logiciels de provisioning, par exemple\net de mani\u00E8re non exhaustive, p2 et Eclipse Update Manager\n("Provisioning Technology") pour permettre aux utilisateurs d'installer\nles logiciels, la documentation, les informations et/ou les autres mat\u00E9riaux (collectivement nomm\u00E9s\n"Installable Software"). Cette possibilit\u00E9 est fournie avec l'objectif de permettre\naux utilisateurs d'installer, d'\u00E9tendre et de mettre \u00E0 jour leurs produits bas\u00E9s sur Eclipse. Les informations\nconcernant le packaging des Installable Software sont disponibles sur\nhttp://eclipse.org/equinox/p2/repository_packaging.html ("Specification").\n\nVous pouvez utiliser la technologie de Provisioning pour permettre \u00E0 des tiers d'installer\ndes Installable Software (logiciels installables). Vous \u00EAtes responsable, en ce qui concerne les\naccords de licence relatifs aux Installable Software, de la pr\u00E9sentation et\nde l'acceptation par les utilisateurs de la technologie de Provisioning, en accord avec la\nSp\u00E9cification. En utilisant la technologie de Provisioning de cette mani\u00E8re et en la rendant\ndisponible en respectant la Sp\u00E9cification, vous reconnaissez donner\nvotre accord et accepter l'acquisition de tous les droits n\u00E9cessaires aux\n\u00E9l\u00E9ments suivants :\n\n1.  Une s\u00E9rie d'actions peut survenir ("Provisioning Process"), au cours de laquelle un utilisateur peut\nex\u00E9cuter la technologie de Provisioning sur une machine ("Target Machine") avec l'\nintention d'installer, d'\u00E9tendre ou de mettre \u00E0 jour la fonctionnalit\u00E9 d'un\nproduit Eclipse.\n2.  Au cours du Provisioning Process, la technologie de Provisioning peut rendre\naccessibles et copiables des Installable Software tiers ou une partie de ceux-ci vers\nla Target Machine.\n3.  Conform\u00E9ment \u00E0 la Sp\u00E9cification, vous fournirez \u00E0 l'utilisateur les termes et\nconditions r\u00E9gissant l'utilisation des Installable Software ("Installable\nSoftware Agreement"). Ces accords Installable Software Agreement sont\naccessibles depuis la Target Machine, conform\u00E9ment \u00E0 la Sp\u00E9cification. Ces\naccords Installable Software Agreement doivent informer l'utilisateur des termes et\nconditions r\u00E9gissant les Installable Software et doivent requ\u00E9rir leur acceptation\npar l'utilisateur final, de la mani\u00E8re prescrite dans les accords Installable\nSoftware Agreement. Une fois l'acceptation effectu\u00E9e par l'utilisateur, la\ntechnologie de Provisioning Technology termine l'installation des\nInstallable Software.\n\nCryptographie\n\nLe Contenu peut contenir des logiciels de chiffrement. Votre pays de r\u00E9sidence\npeut pr\u00E9senter des restrictions relatives \u00E0 l'import, la possession et l\u2019utilisation et/ou le r\u00E9export vers\nun autre pays, des logiciels de chiffrement. AVANT d'utiliser un logiciel de chiffrement,\nv\u00E9rifiez les lois, les r\u00E8gles et les politiques de votre pays concernant l'import,\nla possession ou l'utilisation, ainsi que le r\u00E9export de logiciels de chiffrement, afin de vous assurer que ces op\u00E9rations sont\nautoris\u00E9es.\n\nJava et ses marques d\u00E9pos\u00E9es sont des marques d\u00E9pos\u00E9es d'Oracle Corporation aux\n\u00C9tats-Unis, dans d'autres pays, ou les deux.\n
########### end of license property ##########################################
