toolsPreferencePageLabel=Pr\u00E9f\u00E9rences pour les fonctionnalit\u00E9s, support\u00E9es uniquement si le fichier tools.jar est disponible dans l'h\u00F4te local. Le fichier tools.jar est normalement contenu par la JDK.
jdkRootDirectoryLabel=R\u00E9pertoire racine de la JDK :
browseButton=Parcourir...
updatePeriodLabel=P\u00E9riode durant laquelle rechercher des JVM en cours d'ex\u00E9cution sur l'h\u00F4te local (ms) :
autoDetectGroupLabel=D\u00E9tection auto de JVM dans JVM Explorer
memoryGroupLabel=M\u00E9moire
enterMaxNumberOfClassesMsg=Saisissez le nombre maximal de classes
maxNumberOfClassesInvalidMsg=Nombre maximal de classes invalide.
maxNumberOfClassesOutOfRangeMsg=Le nombre maximal de classes doit \u00EAtre sup\u00E9rieur \u00E0 z\u00E9ro.
maxNumberOfClassesLabel=Nombre max de classes affich\u00E9es dans l'histogramme du tas :
addingClassPathFailedMsg=Impossible d'ajouter tools.jar au chemin de classe.
addingLibraryPathFailedMsg=La biblioth\u00E8que attach\u00E9e partag\u00E9e ne peut \u00EAtre ajout\u00E9e au chemin de la biblioth\u00E8que.
classPathAddedMsg={0} a \u00E9t\u00E9 ajout\u00E9 au chemin de la classe.
jdkRootDirectoryNotFoundMsg=R\u00E9pertoire racine de la JDK introuvable. Sp\u00E9cifiez-le dans la page des Pr\u00E9f\u00E9rences : Java > Monitoring > Attacher.
jdkRootDirectoryFoundMsg=R\u00E9pertoire JDK racine trouv\u00E9 \u00E0 l'emplacement {0}.
jdkRootDirectoryNotEnteredMsg=Saisissez le r\u00E9pertoire racine de la JDK.
notSupportedMsg=Les pi\u00E8ces jointes d'histogramme du tas et des processus JVM automatiques ne sont pas support\u00E9es dans {0}.
selectJdkRootDirectoryMsg=S\u00E9lectionnez le r\u00E9pertoire racine de l'installation de la JDK :
updatePeriodNotEnteredMsg=Saisissez la p\u00E9riode de mise \u00E0 jour.
illegalUpdatePeriodMsg=La p\u00E9riode de mise \u00E0 jour est invalide.
updatePeriodOutOfRangeMsg=La p\u00E9riode de mise \u00E0 jour doit \u00EAtre sup\u00E9rieure \u00E0 100ms.
directoryNotExistMsg=Le r\u00E9pertoire sp\u00E9cifi\u00E9 n'existe pas.
notJdkRootDirectoryMsg=Le r\u00E9pertoire racine n'est pas un r\u00E9pertoire racine JDK.
loadAgentFailedMsg=Impossible de charger le fichier JAR agent {0}.
agentJarNotFoundMsg=Fichier JAR agent introuvable {0}.
agentJarFoundMsg=JAR agent trouv\u00E9 \u00E0 l'emplacement {0}.
corePluginNoFoundMsg=Plug-in principal introuvable.
charsetNotSupportedMsg=UTF8 n'est pas support\u00E9
readInputStreamFailedMsg=Impossible de lire le flux d'entr\u00E9e.
updateTimerCanceledMsg=Mise \u00E0 jour du chrono annul\u00E9e.
getMonitoredJvmFailedMsg=Impossible d'obtenir la JVM monitor\u00E9e.
getLocalConnectorAddressFailedMsg=Impossible d'obtenir l'adresse du connecteur local pour la JVM cible (PID : {0}).
connectTargetJvmFailedMsg=Connexion \u00E0 la JVM cible impossible (PID : {0}).
getMainClassNameFailed=Impossible d'obtenir le nom de la classe principale pour la JVM cible (PID : {0}).
fileNotFoundMsg=Le fichier {0} est introuvable.
