TutorialsDialog.title=Tutoriels guid\u00E9s Talend
TutorialsDialog.tab1.title=Cr\u00E9er un Job/Ajouter une entr\u00E9e
TutorialsDialog.tab2.title=Cr\u00E9er un flux de Job
TutorialsDialog.tab3.title=Mapping
TutorialsDialog.tab4.title=Ex\u00E9cuter le Job
TutorialsDialog.panel1.message=Prenez en main la construction de votre premier Job. Apr\u00E8s la visite guid\u00E9e, vous \u00EAtes familiaris\u00E9(e) avec les diff\u00E9rentes parties du Studio, vous allez pouvoir les utiliser.\r\n\u00C9tape 1 \u2013 Cr\u00E9ez le <b>Job</b> depuis l'ic\u00F4ne de menu.\r\n\u00C9tape 2 \u2013 D\u00E9veloppez la section <b>M\u00E9tadonn\u00E9es</b> \u00E0 gauche et d\u00E9veloppez <b>Fichier d\u00E9limit\u00E9</b> pour trouver et d\u00E9poser la m\u00E9tadonn\u00E9e de fichier plat <b>StreamingResults.csv</b> dans l'espace de mod\u00E9lisation graphique.
TutorialsDialog.panel2.message=Ensuite, vous allez construire le flux complet du Job en ajoutant un composant tMap, utilis\u00E9 pour mapper des colonnes source d'entr\u00E9e \u00E0 des colonnes cible de sortie, puis en ajoutant un composant tFileOutputDelimited de sortie, utilis\u00E9 pour \u00E9crire dans un fichier plat.\r\n\u00C9tape 1 \u2013 Dans l'espace de mod\u00E9lisation graphique, saisissez tMap et s\u00E9lectionnez le tMap, ou glissez-d\u00E9posez ce composant depuis la Palette, sous Traitement, \u00E0 droite de l'espace de mod\u00E9lisation graphique.\r\n\u00C9tape 2 \u2013 Reliez le tFileInputDelimited au tMap en cliquant sur le lien Row de sortie, comme indiqu\u00E9 dans la vid\u00E9o.\r\n\u00C9tape 3 \u2013 Cliquez-droit sur le tMap, s\u00E9lectionnez Row puis *Nouvelle sortie*, glissez-d\u00E9posez et rel\u00E2chez, puis commencez \u00E0 saisir tFileOutputDelimited. Une fois visible, s\u00E9lectionnez-le et il sera reli\u00E9 au tMap.
TutorialsDialog.panel3.message=Dans cette \u00E9tape, vous allez mapper les champs d'entr\u00E9e au champ de sortie et, dans cet exemple, cr\u00E9er le sch\u00E9ma de sortie en m\u00EAme temps.\r\n\u00C9tape 1 \u2013 Double-cliquez sur le composant tMap pour ouvrir l'interface de mapping.\r\n\u00C9tape 2 \u2013 S\u00E9lectionnez les champs que vous souhaitez inclure dans votre fichier de sortie et d\u00E9posez-les dans la sortie (Note : lorsqu'une ligne bleu fonc\u00E9 est visible, rel\u00E2chez la souris pour d\u00E9poser les champs dans la cible. Cela cr\u00E9e les colonnes cible dans le sch\u00E9ma du tFileOutputDelimited).\r\n\u00C9tape 3 \u2013 Cliquez sur OK, puis sur Oui pour sauvegarder et propager vos modifications au sch\u00E9ma du fichier de sortie.
TutorialsDialog.panel4.message=L'\u00E9tape finale est d'ex\u00E9cuter le Job dans l'environnement du Runtime du Studio et de voir les r\u00E9sultats.\r\n\u00C9tape 1 \u2013 Cliquez sur l'onglet Ex\u00E9cution sous l'espace de mod\u00E9lisation graphique.\r\n\u00C9tape 2 \u2013 Cliquez sur le bouton Ex\u00E9cuter\r\nNote \u2013 cela construit le code Java n\u00E9cessaire \u00E0 l'ex\u00E9cution du flux construit dans le Job.  Une fois le code Java construit, le Job s'ex\u00E9cute.  Vous allez voir les m\u00E9triques du flux, sur les liens entre les composants.  Vous pouvez ouvrir le fichier g\u00E9n\u00E9r\u00E9 par le tFileOutputDelimited ou cliquer-droit sur les composants et choisir de visualiser les donn\u00E9es, pour consulter les donn\u00E9es \u00E9crites dans le fichier cible.
