TutorialsDialog.title=Talend\u30C1\u30E5\u30FC\u30C8\u30EA\u30A2\u30EB
TutorialsDialog.tab1.title=\u30B8\u30E7\u30D6\u306E\u4F5C\u6210/\u5165\u529B\u306E\u8FFD\u52A0
TutorialsDialog.tab2.title=\u30B8\u30E7\u30D6\u30D5\u30ED\u30FC\u306E\u4F5C\u6210
TutorialsDialog.tab3.title=\u30DE\u30C3\u30D4\u30F3\u30B0
TutorialsDialog.tab4.title=\u30B8\u30E7\u30D6\u306E\u5B9F\u884C
TutorialsDialog.panel1.message=\u6700\u521D\u306E\u30B8\u30E7\u30D6\u306E\u30D3\u30EB\u30C9\u3092\u958B\u59CB\u3057\u3066\u4E0B\u3055\u3044\u3002 \u6A5F\u80FD\u3092\u7D39\u4ECB\u3059\u308B\u30C4\u30A2\u30FC\u3092\u4E00\u901A\u308A\u7D42\u3048\u308C\u3070\u3001Studio\u306E\u5168\u6A5F\u80FD\u304C\u4F7F\u3048\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002\u3067\u306F\u3001\u5B9F\u969B\u306B\u4F7F\u3063\u3066\u307F\u307E\u3057\u3087\u3046\u3002\u624B\u98061 \u2013 \u8868\u793A\u3055\u308C\u308B\u30E1\u30CB\u30E5\u30FC\u30A2\u30A4\u30B3\u30F3\u304B\u3089\u65B0\u898F<b>\u30B8\u30E7\u30D6</b>\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002 \u624B\u98062 \u2013 \u5DE6\u5074\u306E<b>\u30E1\u30BF\u30C7\u30FC\u30BF</b>\u30BB\u30AF\u30B7\u30E7\u30F3\u3092\u5C55\u958B\u3057\u3001<b>\u5217\u533A\u5207\u308A\u8A18\u53F7\u4ED8\u304D\u30D5\u30A1\u30A4\u30EB</b>\u3092\u5C55\u958B\u3057\u3066\u3001\u30E1\u30BF\u30C7\u30FC\u30BF\u304B\u3089\u30D5\u30E9\u30C3\u30C8\u30D5\u30A1\u30A4\u30EB<b>StreamngResults.csv</b>\u3092\u898B\u3064\u3051\u3066\u30C7\u30B6\u30A4\u30F3\u30A6\u30A3\u30F3\u30C9\u30A6\u306B\u30C9\u30E9\u30C3\u30B0\u3057\u307E\u3059\u3002
TutorialsDialog.panel2.message=\u6B21\u306B\u3001\u5165\u529B\u30BD\u30FC\u30B9\u30AB\u30E9\u30E0\u3092\u51FA\u529B\u30BF\u30FC\u30B2\u30C3\u30C8\u30AB\u30E9\u30E0\u306B\u30DE\u30C3\u30D7\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3059\u308BtMap\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u3001\u7D9A\u3044\u3066\u3001\u30D5\u30E9\u30C3\u30C8\u30D5\u30A1\u30A4\u30EB\u306E\u66F8\u304D\u8FBC\u307F\u306B\u4F7F\u7528\u3059\u308B\u6700\u7D42\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u3067\u3042\u308BtFileOutputDelimited\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u3092\u8FFD\u52A0\u3057\u3066\u3001\u30B8\u30E7\u30D6\u30D5\u30ED\u30FC\u5168\u4F53\u3092\u30D3\u30EB\u30C9\u3057\u307E\u3059\u3002   \u624B\u98061 \u2013 \u30C7\u30B6\u30A4\u30F3\u30A6\u30A3\u30F3\u30C9\u30A6\u306BtMap\u3068\u5165\u529B\u3057\u3066tMap\u3092\u9078\u629E\u3059\u308B\u304B\u3001\u307E\u305F\u306F\u53F3\u5074\u306E[\u51E6\u7406\u4E2D]\u306E\u4E0B\u306B\u3042\u308B\u30D1\u30EC\u30C3\u30C8\u304B\u3089\u30C7\u30B6\u30A4\u30F3\u30A6\u30A3\u30F3\u30C9\u30A6\u306B\u30C9\u30E9\u30C3\u30B0\u3057\u307E\u3059\u3002 \u624B\u98062 \u2013 \u30D3\u30C7\u30AA\u306B\u793A\u3057\u3066\u3044\u308B\u3088\u3046\u306B\u3001\u51FA\u529B\u884C\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3066tFileInputDelimited\u3092tMap\u306B\u63A5\u7D9A\u3057\u307E\u3059\u3002\u624B\u98063 \u2013 tMap\u3092\u53F3\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u884C\u3092\u9078\u629E\u3057\u3001*\u65B0\u898F\u51FA\u529B*\u3092\u9078\u629E\u3057\u3001\u30C9\u30E9\u30C3\u30B0\u30A2\u30F3\u30C9\u30C9\u30ED\u30C3\u30D7\u3057\u307E\u3059\u3002\u6B21\u306B\u3001tFileOutputDelimited\u3068\u5165\u529B\u3057\u307E\u3059\u3002\u5165\u529B\u3092\u958B\u59CB\u3057\u3066\u3053\u308C\u304C\u8868\u793A\u3055\u308C\u305F\u3089\u9078\u629E\u3057\u307E\u3059\u3002\u3053\u308C\u3067tMap\u306B\u63A5\u7D9A\u3055\u308C\u307E\u3057\u305F\u3002
TutorialsDialog.panel3.message=\u3053\u306E\u624B\u9806\u3067\u306F\u3001\u5165\u529B\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u51FA\u529B\u30D5\u30A3\u30FC\u30EB\u30C9\u306B\u30DE\u30C3\u30D4\u30F3\u30B0\u3057\u307E\u3059\u3002\u3053\u306E\u4F8B\u3067\u306F\u3001\u51FA\u529B\u30B9\u30AD\u30FC\u30DE\u3092\u540C\u6642\u306B\u4F5C\u6210\u3057\u3066\u3044\u307E\u3059\u3002 \u624B\u98061 \u2013 tMap\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u3092\u30C0\u30D6\u30EB\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u30DE\u30C3\u30D4\u30F3\u30B0\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30A4\u30B9\u3092\u958B\u304D\u307E\u3059\u3002 \u624B\u98062 \u2013 \u51FA\u529B\u30D5\u30A1\u30A4\u30EB\u5185\u3067\u5FC5\u8981\u306A\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u30CF\u30A4\u30E9\u30A4\u30C8\u3057\u3001\u51FA\u529B\u5074\u306B\u30C9\u30E9\u30C3\u30B0\u3057\u307E\u3059(\u30E1\u30E2: \u6FC3\u3044\u9752\u306E\u884C\u304C\u8868\u793A\u3055\u308C\u305F\u3089\u30DE\u30A6\u30B9\u30DC\u30BF\u30F3\u3092\u30EA\u30EA\u30FC\u30B9\u3057\u3066\u30BF\u30FC\u30B2\u30C3\u30C8\u5185\u306B\u30C9\u30ED\u30C3\u30D7\u3057\u307E\u3059\u3002 \u3053\u308C\u306B\u3088\u308A\u3001tFileOutputDelimited\u30B9\u30AD\u30FC\u30DE\u5185\u306B\u30BF\u30FC\u30B2\u30C3\u30C8\u30AB\u30E9\u30E0\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002) \u624B\u98063 \u2013 [OK]\u3068[\u306F\u3044]\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u5909\u66F4\u3092\u4FDD\u5B58\u3057\u3001\u5909\u66F4\u3092\u51FA\u529B\u30D5\u30A1\u30A4\u30EB\u30B9\u30AD\u30FC\u30DE\u306B\u30D7\u30ED\u30D1\u30B2\u30FC\u30C8\u3057\u307E\u3059\u3002
TutorialsDialog.panel4.message=\u6700\u5F8C\u306E\u624B\u9806\u306F\u3001\u30B8\u30E7\u30D6\u3092Studio\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u74B0\u5883\u5185\u3067\u5B9F\u884C\u3057\u3001\u7D50\u679C\u3092\u8868\u793A\u3059\u308B\u3053\u3068\u3067\u3059\u3002\u624B\u98061 \u2013 \u30C7\u30B6\u30A4\u30F3\u30A6\u30A3\u30F3\u30C9\u30A6\u306E\u4E0B\u306B\u3042\u308B[\u5B9F\u884C]\u30BF\u30D6\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u307E\u3059\u3002\u624B\u98062 - [\u5B9F\u884C]\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u307E\u3059\u3002\u30E1\u30E2 \u2013 \u3053\u308C\u3067\u3001\u30B8\u30E7\u30D6\u5185\u306B\u7D44\u307F\u8FBC\u307E\u308C\u305F\u30D5\u30ED\u30FC\u306E\u5B9F\u884C\u306B\u5FC5\u8981\u306Ajava\u304C\u30D3\u30EB\u30C9\u3055\u308C\u307E\u3059\u3002java\u304C\u30D3\u30EB\u30C9\u3055\u308C\u308B\u3068\u3001\u30B8\u30E7\u30D6\u304C\u5B9F\u884C\u3055\u308C\u307E\u3059\u3002 \u5404\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u9593\u306E\u884C\u306B\u30B9\u30EB\u30FC\u30D7\u30C3\u30C8\u30E1\u30C8\u30EA\u30C3\u30AF\u304C\u8868\u793A\u3055\u308C\u307E\u3059\u3002tFileOutputDelimeted\u304B\u3089\u30D5\u30A1\u30A4\u30EB\u3092\u958B\u304F\u304B\u3001\u307E\u305F\u306F\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u3092\u53F3\u30AF\u30EA\u30C3\u30AF\u3057\u3001\u30D3\u30E5\u30FC\u30C7\u30FC\u30BF\u3092\u9078\u629E\u3057\u3066\u3001\u30BF\u30FC\u30B2\u30C3\u30C8\u30D5\u30A1\u30A4\u30EB\u306B\u66F8\u304D\u8FBC\u307E\u308C\u305F\u30C7\u30FC\u30BF\u3092\u8868\u793A\u3057\u307E\u3059\u3002
